dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC33xED/IfxCpu_bf.h
/** \brief Length for Ifx_CPU_DLMU_SPROT_RGNACCENB_R_Bits.EN58 */
#define IFX_CPU_DLMU_SPROT_RGNACCENB_R_EN58_LEN (1u)

/** \brief Mask for Ifx_CPU_DLMU_SPROT_RGNACCENB_R_Bits.EN58 */
#define IFX_CPU_DLMU_SPROT_RGNACCENB_R_EN58_MSK (0x1u)

/** \brief Offset for Ifx_CPU_DLMU_SPROT_RGNACCENB_R_Bits.EN58 */
#define IFX_CPU_DLMU_SPROT_RGNACCENB_R_EN58_OFF (26u)

/** \brief Length for Ifx_CPU_DLMU_SPROT_RGNACCENB_R_Bits.EN59 */
#define IFX_CPU_DLMU_SPROT_RGNACCENB_R_EN59_LEN (1u)

/** \brief Mask for Ifx_CPU_DLMU_SPROT_RGNACCENB_R_Bits.EN59 */
#define IFX_CPU_DLMU_SPROT_RGNACCENB_R_EN59_MSK (0x1u)

/** \brief Offset for Ifx_CPU_DLMU_SPROT_RGNACCENB_R_Bits.EN59 */
#define IFX_CPU_DLMU_SPROT_RGNACCENB_R_EN59_OFF (27u)

/** \brief Length for Ifx_CPU_DLMU_SPROT_RGNACCENB_R_Bits.EN60 */
#define IFX_CPU_DLMU_SPROT_RGNACCENB_R_EN60_LEN (1u)

/** \brief Mask for Ifx_CPU_DLMU_SPROT_RGNACCENB_R_Bits.EN60 */
#define IFX_CPU_DLMU_SPROT_RGNACCENB_R_EN60_MSK (0x1u)

/** \brief Offset for Ifx_CPU_DLMU_SPROT_RGNACCENB_R_Bits.EN60 */
#define IFX_CPU_DLMU_SPROT_RGNACCENB_R_EN60_OFF (28u)

/** \brief Length for Ifx_CPU_DLMU_SPROT_RGNACCENB_R_Bits.EN61 */
#define IFX_CPU_DLMU_SPROT_RGNACCENB_R_EN61_LEN (1u)

/** \brief Mask for Ifx_CPU_DLMU_SPROT_RGNACCENB_R_Bits.EN61 */
#define IFX_CPU_DLMU_SPROT_RGNACCENB_R_EN61_MSK (0x1u)

/** \brief Offset for Ifx_CPU_DLMU_SPROT_RGNACCENB_R_Bits.EN61 */
#define IFX_CPU_DLMU_SPROT_RGNACCENB_R_EN61_OFF (29u)

/** \brief Length for Ifx_CPU_DLMU_SPROT_RGNACCENB_R_Bits.EN62 */
#define IFX_CPU_DLMU_SPROT_RGNACCENB_R_EN62_LEN (1u)

/** \brief Mask for Ifx_CPU_DLMU_SPROT_RGNACCENB_R_Bits.EN62 */
#define IFX_CPU_DLMU_SPROT_RGNACCENB_R_EN62_MSK (0x1u)

/** \brief Offset for Ifx_CPU_DLMU_SPROT_RGNACCENB_R_Bits.EN62 */
#define IFX_CPU_DLMU_SPROT_RGNACCENB_R_EN62_OFF (30u)

/** \brief Length for Ifx_CPU_DLMU_SPROT_RGNACCENB_R_Bits.EN63 */
#define IFX_CPU_DLMU_SPROT_RGNACCENB_R_EN63_LEN (1u)

/** \brief Mask for Ifx_CPU_DLMU_SPROT_RGNACCENB_R_Bits.EN63 */
#define IFX_CPU_DLMU_SPROT_RGNACCENB_R_EN63_MSK (0x1u)

/** \brief Offset for Ifx_CPU_DLMU_SPROT_RGNACCENB_R_Bits.EN63 */
#define IFX_CPU_DLMU_SPROT_RGNACCENB_R_EN63_OFF (31u)

/** \brief Length for Ifx_CPU_OSEL_Bits.SHOVEN_x */
#define IFX_CPU_OSEL_SHOVEN_X_LEN (32u)

/** \brief Mask for Ifx_CPU_OSEL_Bits.SHOVEN_x */
#define IFX_CPU_OSEL_SHOVEN_X_MSK (0xffffffffu)

/** \brief Offset for Ifx_CPU_OSEL_Bits.SHOVEN_x */
#define IFX_CPU_OSEL_SHOVEN_X_OFF (0u)

/** \brief Length for Ifx_CPU_BLK_RABR_Bits.OBASE */
#define IFX_CPU_BLK_RABR_OBASE_LEN (17u)

/** \brief Mask for Ifx_CPU_BLK_RABR_Bits.OBASE */
#define IFX_CPU_BLK_RABR_OBASE_MSK (0x1ffffu)

/** \brief Offset for Ifx_CPU_BLK_RABR_Bits.OBASE */
#define IFX_CPU_BLK_RABR_OBASE_OFF (5u)

/** \brief Length for Ifx_CPU_BLK_RABR_Bits.OMEM */
#define IFX_CPU_BLK_RABR_OMEM_LEN (4u)

/** \brief Mask for Ifx_CPU_BLK_RABR_Bits.OMEM */
#define IFX_CPU_BLK_RABR_OMEM_MSK (0xfu)

/** \brief Offset for Ifx_CPU_BLK_RABR_Bits.OMEM */
#define IFX_CPU_BLK_RABR_OMEM_OFF (24u)

/** \brief Length for Ifx_CPU_BLK_RABR_Bits.OVEN */
#define IFX_CPU_BLK_RABR_OVEN_LEN (1u)

/** \brief Mask for Ifx_CPU_BLK_RABR_Bits.OVEN */
#define IFX_CPU_BLK_RABR_OVEN_MSK (0x1u)

/** \brief Offset for Ifx_CPU_BLK_RABR_Bits.OVEN */
#define IFX_CPU_BLK_RABR_OVEN_OFF (31u)

/** \brief Length for Ifx_CPU_BLK_OTAR_Bits.TBASE */
#define IFX_CPU_BLK_OTAR_TBASE_LEN (23u)

/** \brief Mask for Ifx_CPU_BLK_OTAR_Bits.TBASE */
#define IFX_CPU_BLK_OTAR_TBASE_MSK (0x7fffffu)

/** \brief Offset for Ifx_CPU_BLK_OTAR_Bits.TBASE */
#define IFX_CPU_BLK_OTAR_TBASE_OFF (5u)

/** \brief Length for Ifx_CPU_BLK_OMASK_Bits.OMASK */
#define IFX_CPU_BLK_OMASK_OMASK_LEN (12u)

/** \brief Mask for Ifx_CPU_BLK_OMASK_Bits.OMASK */
#define IFX_CPU_BLK_OMASK_OMASK_MSK (0xfffu)

/** \brief Offset for Ifx_CPU_BLK_OMASK_Bits.OMASK */
#define IFX_CPU_BLK_OMASK_OMASK_OFF (5u)

/** \brief Length for Ifx_CPU_BLK_OMASK_Bits.ONE */
#define IFX_CPU_BLK_OMASK_ONE_LEN (11u)

/** \brief Mask for Ifx_CPU_BLK_OMASK_Bits.ONE */
#define IFX_CPU_BLK_OMASK_ONE_MSK (0x7ffu)

/** \brief Offset for Ifx_CPU_BLK_OMASK_Bits.ONE */
#define IFX_CPU_BLK_OMASK_ONE_OFF (17u)

/** \brief Length for Ifx_CPU_SEGEN_Bits.ADFLIP */
#define IFX_CPU_SEGEN_ADFLIP_LEN (8u)

/** \brief Mask for Ifx_CPU_SEGEN_Bits.ADFLIP */
#define IFX_CPU_SEGEN_ADFLIP_MSK (0xffu)

/** \brief Offset for Ifx_CPU_SEGEN_Bits.ADFLIP */
#define IFX_CPU_SEGEN_ADFLIP_OFF (0u)

/** \brief Length for Ifx_CPU_SEGEN_Bits.ADTYPE */
#define IFX_CPU_SEGEN_ADTYPE_LEN (2u)

/** \brief Mask for Ifx_CPU_SEGEN_Bits.ADTYPE */
#define IFX_CPU_SEGEN_ADTYPE_MSK (0x3u)

/** \brief Offset for Ifx_CPU_SEGEN_Bits.ADTYPE */
#define IFX_CPU_SEGEN_ADTYPE_OFF (8u)

/** \brief Length for Ifx_CPU_SEGEN_Bits.AE */
#define IFX_CPU_SEGEN_AE_LEN (1u)

/** \brief Mask for Ifx_CPU_SEGEN_Bits.AE */
#define IFX_CPU_SEGEN_AE_MSK (0x1u)

/** \brief Offset for Ifx_CPU_SEGEN_Bits.AE */
#define IFX_CPU_SEGEN_AE_OFF (31u)

/** \brief Length for Ifx_CPU_TASK_ASI_Bits.ASI */
#define IFX_CPU_TASK_ASI_ASI_LEN (5u)

/** \brief Mask for Ifx_CPU_TASK_ASI_Bits.ASI */
#define IFX_CPU_TASK_ASI_ASI_MSK (0x1fu)

/** \brief Offset for Ifx_CPU_TASK_ASI_Bits.ASI */
#define IFX_CPU_TASK_ASI_ASI_OFF (0u)

/** \brief Length for Ifx_CPU_PMA0_Bits.DAC */
#define IFX_CPU_PMA0_DAC_LEN (16u)

/** \brief Mask for Ifx_CPU_PMA0_Bits.DAC */
#define IFX_CPU_PMA0_DAC_MSK (0xffffu)

/** \brief Offset for Ifx_CPU_PMA0_Bits.DAC */
#define IFX_CPU_PMA0_DAC_OFF (0u)

/** \brief Length for Ifx_CPU_PMA1_Bits.CAC */
#define IFX_CPU_PMA1_CAC_LEN (16u)

/** \brief Mask for Ifx_CPU_PMA1_Bits.CAC */
#define IFX_CPU_PMA1_CAC_MSK (0xffffu)

/** \brief Offset for Ifx_CPU_PMA1_Bits.CAC */
#define IFX_CPU_PMA1_CAC_OFF (0u)

/** \brief Length for Ifx_CPU_PMA2_Bits.PSI */
#define IFX_CPU_PMA2_PSI_LEN (16u)

/** \brief Mask for Ifx_CPU_PMA2_Bits.PSI */
#define IFX_CPU_PMA2_PSI_MSK (0xffffu)

/** \brief Offset for Ifx_CPU_PMA2_Bits.PSI */
#define IFX_CPU_PMA2_PSI_OFF (0u)

/** \brief Length for Ifx_CPU_DCON2_Bits.DCACHE_SZE */
#define IFX_CPU_DCON2_DCACHE_SZE_LEN (16u)

/** \brief Mask for Ifx_CPU_DCON2_Bits.DCACHE_SZE */
#define IFX_CPU_DCON2_DCACHE_SZE_MSK (0xffffu)

/** \brief Offset for Ifx_CPU_DCON2_Bits.DCACHE_SZE */
#define IFX_CPU_DCON2_DCACHE_SZE_OFF (0u)

/** \brief Length for Ifx_CPU_DCON2_Bits.DSCRATCH_SZE */
#define IFX_CPU_DCON2_DSCRATCH_SZE_LEN (16u)

/** \brief Mask for Ifx_CPU_DCON2_Bits.DSCRATCH_SZE */
#define IFX_CPU_DCON2_DSCRATCH_SZE_MSK (0xffffu)

/** \brief Offset for Ifx_CPU_DCON2_Bits.DSCRATCH_SZE */
#define IFX_CPU_DCON2_DSCRATCH_SZE_OFF (16u)

